backend/app/controllers/offense_categories_controller.rb

SELECT "offense_categories".* FROM "offense_categories"
---
    def index
        @offenses = OffenseCategory.all

INSERT INTO "offense_categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "thing that offends me"], ["created_at", "2020-10-10 02:01:09.595639"], ["updated_at", "2020-10-10 02:01:09.595639"]]
---
    def create
        @offense = OffenseCategory.create!(offense_params)

SELECT "offense_categories".* FROM "offense_categories" WHERE "offense_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_offense
        @offense = OffenseCategory.find_by_id(params['id'])