backend/app/controllers/twitter_profiles_controller.rb

SELECT "twitter_profiles".* FROM "twitter_profiles"
---
    def index
        @profs = TwitterProfile.all

INSERT INTO "twitter_profiles" ("username", "user_id", "display_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "realDonaldTrump"], ["user_id", 25073877], ["display_name", "Donald J. Trump"], ["created_at", "2020-10-21 00:37:06.190142"], ["updated_at", "2020-10-21 00:37:06.190142"]]
SELECT "offense_categories".* FROM "offense_categories"
SELECT "offense_categories".* FROM "offense_categories" WHERE "offense_categories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def create
        @prof = TwitterProfile.create!(prof_params)
        if params[:offense_categories]
            params[:offense_categories].each do |offense|
                @prof.offense_categories << OffenseCategory.find_by_id(offense)

SELECT "twitter_profiles".* FROM "twitter_profiles" WHERE "twitter_profiles"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
    def set_prof
        @prof = TwitterProfile.find_by_id(params['id'])